
[
    {"author":"Egho-Promise,Joseph U.Meshach,Satya Vir Singh", "title":"Continuous Process Improvement of Mobile Communication from 1G to 4G. International Conference On Management, Communication and Technology (ICMCT), volume l (4), 13-25.", "link":"https://www.ijictm.org/pdf/folder-1/2016-09-14-06-44-39.pdf"},

    {"author":"Ehigiator I. Egho-Promise, Kwadwo Fosu Appiah and Asante, G", "title":"Data Security Issues in Corporate Environment.  Digital Innovations & Contemporary Research in Science and Engineering Journal, volume 5(2), 63-78.", "link":"https://www.isteams.net/_files/ugd/185b0a_a1006e8f5ebb499c890ab08e28d3230c.pdf"},

    {"author":"Bamidele Ola and Ehigiator I. Egho-Promise.", "title":"Cybersecurity Threat Modelling: A Case Study of An Ecommerce Platform Migration to the Public Cloud. EJECE, European Journal of Electrical Engineering and Computer Science, Volume (4), 1-7. doi: ", "link":"http://dx.doi.org/10.24018/ejece.2020.4.4.237"},

    {"author":"Ehigiator I. Egho-Promise, Bamidele Ola and Emmanuel Opoku Sarkodie", "title":"A Cyber Forensics Study of ATM Data Traffic. International Journal of Innovative Research in Information Security, volume 7(7), 69-75.", "link":"https://doi.org/10.26562/ijiris.2020.v0707.001"},

    {"author":"Ehigiator I. Egho-Promise, Bamidele Ola, Aaron Arhin and Richard Asuming", "title":"A Forensic Analysis of WhatsApp on Android Smart Phone. International Research Journal of Computer Science, volume 7(8), 209-219.", "link":"https://doi.org/10.26562/irjcs.2020.v0708.001"},

    {"author":"Ehigiator I. Egho-Promise  and Isaac Quarshie", "title":"Network Forensic Evaluation of Privacy Browsers. International Journal of Computer Techniques, volume 7(4), 1-13.", "link":"http://www.ijctjournal.org/archives/ijct-v7i4p5.pdf"},

    {"author":"Ehigiator I. Egho-Promise and Mensah Sitti", "title":"Big Data Security Management in Digital Environment. American Journal of Multidisciplinary Research & Development, volume 06(02), 1-34.", "link":"https://www.ajmrd.com/vol-6-issue-2/"},

    {"author":"Ehigiator I. Egho-Promise, Richard Antwi Birikorang, Janet Acquah, Jephter Kankam and Emmanuel Akomeah Arhin", "title":"Automated Cyberbullying Detection and Prevention System. International Journal of Innovative Science and Research Technology, volume 5(8), 1176-1179.", "link":"https://DOI.org/10.38124/IJISRT20AUG746"},

    {"author":"Ehigiator I. Egho-Promise, Bamidele Ola and Bright- Edujih Kuleke  ", "title":"Securing Lecture Hall Key System Using RFID Technology. American Journal of Multidisciplinary Research & Development, volume 3(01),1-7.", "link":"https://www.ajmrd.com/vol-3-issue-1/"},

    {"author":"Ehigiator I. Egho-Promise  and Amankwah Stephen.", "title":"Design and Implementation of VLANs WITH Circuit Group: A Case Study of Hohoe Municipal Hospital. International Journal of Innovative Research in Science, Engineering and Technology, Volume 9(8), 7554-7560. ", "link":"https://www.ijirset.com/upload/2020/august/4_DESIGN_NC.PDF"},

    {"author":"Ehigiator I. Egho-Promise , George Asante and Raymond Owusu Agyei, ", "title":"The Impact of Cloud Computing in Developing Countries: A Case Study of Ghana.  AIMS journal, vol. 2(4), 1-16.", "link":"https://fcc08321-8158-469b-b54d-f591e0bd3df4.filesusr.com/ugd/185b0a_56c346cbff0647019112b725bb764fbb.pdf"},

    {"author":"Ehigiator I. Egho-Promise, Isaac Owusu Amoako, Jonathan Tamakloe, Bamidele Ola.", "title":"An Android mobile app for highlighting security vulnerabilities in WhatsApp. International Journal of Innovative Research in Computer and Communication Engineering, Volume 8(5), 1831-1839.", "link":"https://www.ijircce.com/get-current-issue.php?key=MTAzhttps://ijircce.com/admin/main/storage/app/pdf/DK8iIfbJ0CEL8CjXmBOKs8upWY3zd8LmIHnMQNYb.pdf"},

    {"author":"Ehigiator I. Egho-Promise,Nkrumah P.,Adjei Twumasi C.,Sododzie G. and Senyo  B.", "title":"Automation of Fuel Tank Level Monitoring and Measurement. International Journal of Engineering Science and Invention, volume 9(8),43-49.", "link":"https://www.ijesi.org/papers/Vol(9)i8/Ser-1/F0908014349.pdf"},

    {"author":"Ehigiator I. Egho-Promise, Michael Ofosu-Appiah, Sandra Osei Somuah and Sarah Asabea Addo.", "title":"Online Gas (LPG) Booking System: A Case Study of LPG Stations in Ghana. International Journal of Scientific Research & Engineering Trends, volume 6(4), 2623-2626. ", "link":"https://ijsret.com/wp-content/uploads/2020/07/IJSRET_V6_issue4_604.pdf"},

    {"author":"Ehigiator I. Egho-Promise, Isaac Kwame Eviwu, Emmanuel Siaw, Evans Narh and Dorcas Appiah.", "title":"Water Digital Meter Using Mobile Phone: A Case Study Of Ghana Water Company Limited. International Journal of Innovative Research and Advanced Studies, volume 7(7), 186-191.", "link":"http://www.ijiras.com/2020/Vol_7-Issue_7/paper_25.pdf"},

    {"author":"Ehigiator I. Egho-Promise  and Bamidele Ola.", "title":"Automated Telecom Network Information System: A Case Study of Glo Mobile Ghana Limited. Global Scientific Journals, volume 8(7), 2443-2455.", "link":"http://www.globalscientificjournal.com/researchpaper/AUTOMATED_TELECOM_NETWORK_INFORMATION_SYSTEM_A_CASE_STUDY_OF_GLO_MOBILE_GHANA_LIMITED.pdf"},

    {"author":"Ehigiator I. Egho-Promise  and  Nayan Simon N-Yemawan", "title":"Techniques for Detecting Fake Images in Multimedia. International Research Journal of Modernization in Engineering Technology and Science, volume 2(8), 820-823. ", "link":"https://www.irjmets.com/pastvolumeissue.php?p=0&keywor=TECHNIQUES+FOR+DETECTING+FAKE+IMAGES+IN+MULTIMEDIA"},

    {"author":"Ehigiator I. Egho-Promise, Stephen and Ola Bamidele.", "title":"E-Agriculture Management System :A Case Study of Aflao Ketu South Municipality in Ghana. Quest Journals Journal of Software Engineering and Simulation, volume 6(1), 38-49.", "link":"http://www.questjournals.org/jses/papers/Vol6-issue-1/E06013849.pdf"},

    {"author":"Ehigiator I. Egho-Promise , Finu C. P. , Kponyo D. and  Amankwah J.", "title":"E-Telecommunication Information System. International Journal of Research -GRANTHAALAYAH, volume 8(8), 403-412. ", "link":"https://doi.org/10.29121/granthaalayah.v8.i8.2020.1181"},

    {"author":"Ehigiator I. Egho-Promise  and Bamidele Ola", "title":"Digitalize Power System in Telecommunication Network Environment: A case study of Telecom companies in Ghana. International Journal of Computer Science and Technology, volume 11(3), 20-24. ", "link":"http://www.ijcst.com/vol11/issue3/3-dr-egho-promise-ehigiator-Iyobor.pdf"},

    {"author":"Ehigiator I. Egho-Promise , Bamidele Ola and Nii Armar Adjaidoo", "title":"Computerized Telecom Network Spare Parts Management System. International Journal of Engineering Sciences & Research Technology, volume 9 (9), 99-107.", "link":"https://www.ijesrt.com/Old_IJESRT/issues%20pdf%20file/Archive-2020/September-2020/11.pdf"},

    {"author":"Ehigiator I. Egho-Promise  and Bamidele Ola. ", "title":"Automated Mobile Telecom Cell Site System. European Journal of Engineering Research and Science, volume 5(10), 1-6.", "link":" https://www.ej-eng.org/index.php/ejeng/article/view/2167"},

    {"author":"Ehigiator I. Egho-Promise, Mensah Sitt, Nasiru HutchfuL and William Akotam Agangiba.", "title":"IoT-Enhanced Weather Monitoring System: Affordable Hardware Solution for Real-Time Data Collection, Storage, And Predictive Analysis. European Journal of Computer Science and Information Technology, volume 12(1), 43-56.", "link":"https://eajournals.org/ejcsit/wp-content/uploads/sites/21/2024/01/IOT-Enhanced.pdf"},

    {"author":"Mensah Sitti, Ehigiator I. Egho-Promise, Nivash Thirunavukarasu  and Jesse Adjei-Asare. ", "title":"Towards Sustainable Agriculture Management: IoT-Enabled Greenhouse Monitoring and Regulation          System for Year-Round Crop Cultivation. London Journal of Research in Science: Natural and Forma, volume 24(3), 1-9.", "link":"https://journalspress.com/LJRS_Volume24/Towards-Sustainable-Agriculture-Management-IoT-Enabled-Greenhouse-Monitoring-and-Regulation-System-for-Year-Round-Crop-Cultivation.pdf"},

    {"author":"Ehigiator I. Egho-Promise and Mensah Sitti", "title":"Web Framework Content Based Filtering for Picture Sharing. Computing, Information Systems, Development Informatics & Allied Research Journal, volume 15(1), 29-46.", "link":" https://doi.org/10.22624/AIMS/CISDI/V15N1P3"},

    {"author":"Lyada Emmanuel, Ehigiator I. Egho-Promise, John K. Alhassan, Mustapha Aminu Bagwa", "title":"Copyright Content User Licensing Model for Collective management Organizations in Uganda. Journal of Behavioral Informatics Digital Humanities and Development Research, volume 9(3), 17-40.", "link":"https://doi.org/10.22624/AIMS/BHI/V10N1P2"},

    {"author":"Ehigiator I. Egho-Promise, Sunday Idahosa, George Asante and Augusta Okungbawa.", "title":"Digital Forensic Investigation Standards in Cloud Computing. Universal Journals of Computer Sciences and Communications, volume 3(1), 1-23. ", "link":"https://doi.org/10.31586/ujcsc.2024.923"},

    {"author":"Lyada Emmanuel, Ehigiator I. Egho-Promise, Francis Kemausuor  and Kageni Peter ", "title":"Utilization of Intellectual Property systems as a tool to promote innovation in Uganda’s public academic institutions: A case study of Makerere and Kyambogo universities. International Journal of Innovation Scientific Research and Review, volume 6(4), 6218—6226.", "link":"https://www.journalijisr.com/issue/utilization-intellectual-property-systems-tool-promote-innovation-uganda%E2%80%99s-public-academic"},

    {"author":"Ehigiator I. Egho-Promise, Emmanuel Lyada, George Asanre and Folayo Aina,", "title":"Towards Improved Vulnerability Management in Digital Environment: A comprehensive Framework for Cybersecurity Enhancement. International Research Journal of Computer Science. volume 11(5), ", "link":"https://doi.org/10.26562/irjcs.2024.v1105.01"},

    {"author":"Hewa Balisane, Ehigiator I.  Egho-Promise, Emmanuel Lyada and Folayo Aina", "title":"Towards Improved Threat Mitigation in Digital Environments: A Comprehensive Framework for Cybersecurity Enhancement. International Journal of Research –GRANTHAALAYAH, volume 12(5),108-123.", "link":"https://doi.org/10.29121/granthaalayah.v12.i5.2024.5655"},

    {"author":"Hewa Balisane, Ehigiator I.  Egho-Promise, Emmanuel Lyada , Folayo Aina, Abimbola Sangodoyin and Halima Kure", "title":"The Effectiveness of a Comprehensive threat Mitigation Framework in Networking: A Multi-Layered Approach to Cyber Security. International Research Journal of Computer Science, volume 11(6), 529-538.", "link":"https://doi.org/10.26562/irjcs.2024.v1106.03"},

    {"author":"Smile Dzisi, Ehigiator Egho-Promise, Bamidele Ola & Ewere Uche Airhihen", "title":"Computerised Record Keeping System in Small and Medium Scale Enterprise. Journal of Behavioral Informatics Digital Humanities & Development Research, Vol 8(4), 45-62.", "link":"https://www.isteams.net/behavioralinformaticsjournal"}

]